# Install cask apps
cask "calibre"
cask "discord"
cask "docker"
cask "google-chrome"
cask "github"
cask "iterm2"
cask "slack"
cask "transmission"
cask "vlc"
cask "visual-studio-code"

tap "simplydanny/pass-extensions"

brew "awscli"
brew "bat"
brew "chruby"
brew "ddgr"
brew "fzf"
brew "git"
brew "gh"
brew "gnupg"
brew "openssl@3"
brew "pass"
brew "pass-update"
brew "pinentry-mac"
brew "ripgrep"
brew "rsync"
brew "tree"
brew "vim"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "pure"

# Install from fonts from casks
tap "homebrew/cask-fonts"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-lato"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-open-sans"
cask "font-roboto"
cask "font-bitstream-vera"
