# Install cask apps
cask "brave-browser"
cask "github"
cask "calibre"
cask "flux"
cask "iterm2"
cask "spotify"
cask "steam"
cask "transmission"
cask "visual-studio-code"
cask "vlc"

tap "simplydanny/pass-extensions"

brew "bat"
brew "ddgr"
brew "fzf"
brew "git"
brew "gnupg"
brew "openssl"
brew "pass"
brew "pass-update"
brew "pinentry-mac"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "terminal-notifier"
brew "tree"
brew "vim", args: ["override-system-vi"] 
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"

# Install from fonts from casks
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-lato"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-bitstream-vera"
cask "font-bitstreamverasansmono-nerd-font-mono"
