# Install cask apps
cask "anki"
cask "arq"
cask "brave-browser"
cask "github"
cask "calibre"
cask "dash"
cask "encryptme"
cask "flux"
cask "google-chrome"
cask "iterm2"
cask "little-snitch"
cask "overdrive-media-console"
cask "sequel-pro"
cask "slack"
cask "spotify"
cask "steam"
cask "transmission"
cask "unrarx"
cask "visual-studio-code"
cask "vlc"

tap "simplydanny/pass-extensions"

brew "awscli"
brew "bat"
brew "chruby"
brew "ddgr"
brew "fzf"
brew "git"
brew "gnupg"
brew "heroku"
brew "node"
brew "nvm"
brew "pass"
brew "pass-update"
brew "pinentry-mac"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "shpotify"
brew "terminal-notifier"
brew "tree"
brew "vim", args: ["override-system-vi"] 
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-autosuggestions"

# Install from fonts from casks
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-iosevka"
cask "font-lato"
cask "font-merriweather"
cask "font-merriweather-sans"
cask "font-open-sans"
cask "font-roboto"
cask "font-roboto-condensed"
cask "font-bitstream-vera"
cask "font-bitstreamverasansmono-nerd-font-mono"
